21-authentication/snack-tracker/app/controllers/application_controller.rb

    def current_username
        if @user
            @user.username
        else
            @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]