21-authentication/snack-tracker/app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"
---
  def index
    @snacks = Snack.all

INSERT INTO "snacks" ("name", "deliciousness", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["deliciousness", 1], ["created_at", "2018-08-16 15:06:52.684516"], ["updated_at", "2018-08-16 15:06:52.684516"]]
---
  def create
    # byebug
    @snack = Snack.create(accepted_params)

UPDATE "snacks" SET "name" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["name", "Twinkies"], ["updated_at", "2018-08-13 18:52:47.246729"], ["id", 4]]
---
  def update
    @snack.update(accepted_params)

DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 5]]
---
  def destroy
    @snack.destroy

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def find_snack
    @snack = Snack.find(params[:id])