21-authentication/snack-tracker/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.valid?
        @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "tim"], ["created_at", "2018-08-21 18:17:16.059527"], ["updated_at", "2018-08-21 18:17:16.059527"], ["password_digest", "$2a$10$wjAjuToHIB3hCOH2vC2u8uMCZT61bzihZSPR.m35BL8fwmDTf5B.m"]]