18-rails_associations/snack-tracker/app/views/retailers/show.html.erb

<ul>
    <% @retailer.snacks.each do |snack| %>
---
SELECT "snacks".* FROM "snacks" WHERE "snacks"."retailer_id" = ?  [["retailer_id", 2]]