19-rails-validations/snack-tracker/app/controllers/retailers_controller.rb

  def index
    @retailers = Retailer.all
---
SELECT "retailers".* FROM "retailers"

  def show
    @retailer = Retailer.find(params[:id])
---
SELECT  "retailers".* FROM "retailers" WHERE "retailers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    retailer = Retailer.create(accepted_retailer_form_fields)
---
INSERT INTO "retailers" ("name", "year_established", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Wonka"], ["year_established", 1908], ["created_at", "2018-08-14 14:28:48.816240"], ["updated_at", "2018-08-14 14:28:48.816240"]]

  def destroy
    @retailer = Retailer.find(params[:id])
    @retailer.destroy
---
SELECT  "retailers".* FROM "retailers" WHERE "retailers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "retailers" WHERE "retailers"."id" = ?  [["id", 4]]