19-rails-validations/snack-tracker/app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"
---
  def index
    @snacks = Snack.all

INSERT INTO "snacks" ("name", "deliciousness", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["deliciousness", 1], ["created_at", "2018-08-16 15:06:52.684516"], ["updated_at", "2018-08-16 15:06:52.684516"]]
---
  def create
    @snack = Snack.create(accepted_params)

UPDATE "snacks" SET "name" = ?, "deliciousness" = ?, "calories" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["name", "Popcorn"], ["deliciousness", 6], ["calories", 200], ["updated_at", "2018-08-13 18:44:51.588255"], ["id", 2]]
---
  def update
    @snack.update(accepted_params)

DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 3]]
---
  def destroy
    @snack.destroy

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_snack
    @snack = Snack.find(params[:id])